{
  "en": {
    "qusai": "hahaha",
    "toChangeLanguage": "عربى",
    "mainTitle": "Are the Jordanian Government websites safe?",
    "subTitle": "HTTPs protocol provides safety & privacy for users and prevents censorship. JOSA wanted to evaluate the safety of Jordanian Government websites by determining the percentage of .gov.jo websites that use HTTPs protocol.",
    "abthttps": "About Https",
    "imphttps": "Importance of Https",
    "methodology": "Methodology",
    "Domain": "Domain",
    "Domain(Agency)_short": "Domain(Agency)",
    "Domain_short": "Domain",
    "Agency": "Agency",
    "agency_en": "Agency",
    "Agency_short": "Agency",
    "Domain Supports HTTPS": "Domain Supports HTTPS",
    "Domain Supports HTTPS_short": "HTTPS",
    "Domain Enforces HTTPS": "Domain Enforces HTTPS",
    "Domain Enforces HTTPS_short": "Enforces HTTPS",
    "HSTS": "Uses HSTS",
    "HSTS_short": "HSTS",
    "grade": "Grade",
    "grade_short": "Grade",
    "out_of": " out of ",
    "josa": "Jordan Open Source Association Official Website",
    "home": "Home",
    "intro": "Introduction",
    "intro_content": "Delivering webpages and data over an HTTP connection exposes Web users to security risks. Since servers are usually not directly connected to each other, they must pass their requests and responses through a series of network routers. These routers, located between servers, have full access to requests sent over HTTP connections because the data is transmitted as plain, unencrypted text. Routers can act as a \"man in the middle\" and read or manipulate the data in transit.\n \nThis can cause users to receive tampered information or direct them to hostile servers that attackers use to steal information such as passwords and credit card information. This type of interception cannot be detected because a compromised HTTP response appears identical to the real response.\n",
    "what": "What is HTTPs?",
    "what_content": "Hypertext Transfer Protocol Secure, or HTTPS, is the secure version of HTTP. HTTPS is the primary protocol used to send data between a Web browser and a website. HTTPS is encrypted in order to increase the security of data transmission, this is especially important when users transfer sensitive data, such as logging into a bank account or an email service or their health insurance provider.\n\nAny website, especially one that requires login credentials must use HTTPS. In modern Web browsers like Chrome and Firefox, websites that do not use HTTPS are distinguished from those that do. Often users will find a green padlock in the URL bar to indicate that the connection between the Webpage and the server is secure. Web browsers take HTTPS very seriously.\n",
    "how": "How does HTTPS work?",
    "how_content": "HTTPS uses a specific communication protocol to encrypt the data in transit. The protocol is called Transport Layer Security (or TLS). It was previously known as Secure Sockets Layer (or SSL). This protocol secures communications using what is known as an asymmetric public key infrastructure. This type of security system uses two different keys to encrypt communications between the two parties:\n\nA private key - This key is controlled by the owner of the website and kept as private. This key resides on a web server and is used to decrypt the information encrypted by the public key.\n\nA public key - This key is available to anyone who wants to communicate with the server in a secure manner. The information that is encrypted with the public key can only be decrypted with the private key.\n",
    "whatHSTS": "What is HSTS?",
    "whatHSTS_content": "HSTS stands for HTTP Strict Transport Security. It is a method used by websites to reach a secure (HTTPS) connection. If a website advertises an HSTS policy, the browser must reject all HTTP connections and prevent users from accepting insecure SSL certificates. HSTS is currently supported by most major browsers (with only some mobile browsers not supporting it).\n\nThis activates a strict transport security policy. It enforces these connections via HTTPS encryption, ignoring any script to download any resource in that domain over HTTP (that includes images). HSTS is just one stock in a bundled package of security settings for your web server or web hosting service.\n",
    "imp": "Why is HTTPS important? What happens if a website doesn't have HTTPS?",
    "imp_content": "HTTPS prevents websites from broadcasting their information in a way that is easy for anyone to intrude on the network. For example, when the information is sent over the regular HTTP protocol, the information is divided into packets of data that can be easily \"tracked\" using free software. This makes communication over an insecure medium, such as public Wi-Fi, more vulnerable to interception. In fact, all HTTP communication occurs in unencrypted plain text making it vulnerable to attacks, anyone with the right tools can intercept the data in transit.\n",
    "benefits": "HTTPS Benefits",
    "ben1_title": "Better website security:",
    "ben1_content": "HTTPS ensures that all communication between a webpage and the server is encrypted. Therefore all responses sent and received, are sent and received from the authenticating server.\n",
    "ben2_title": "Protects user privacy:",
    "ben2_content": "Without HTTPS, an eavesdropper can spy on communication in transit and know what you’re reading online. With HTTPS, an eavesdropper can only see whatever’s not encrypted, which is very little.",
    "ben3_title": "Avoid unwanted content modification:",
    "ben3_content": "If an eavesdropper can read unencrypted data in transit, they are also able to modify that content.\n",
    "ben4_title": "Higher search rankings:",
    "ben4_content": "TLS/SSL certificates correlate with higher rankings on search engines, which is a necessity to increase trust in government websites.\n",
    "ben5_title": "Avoid browser warnings:",
    "ben5_content": "Most modern browsers will give users a warning upon entering a site not protected by HTTPS. This often deters users from entering the site, as most often they comply with the warning message.",
    "meth_subtitle": "The following steps were followed to conduct this research:",
    "meth_step1": "Obtaining a list of government-related websites",
    "meth_step1_content": "After submitting a formal paper in-person request to the Ministry of Digital Economy, we received a list of government-related websites (domains) along with their responsible government entity. ",
    "meth_step2": "Enumerating all known subdomains for each domain",
    "meth_step2_content": "Since each subdomain can define different endpoints that may or may not adhere to HTTPs best practices, covering all possible subdomains is very important. Accordingly, for each domain, we used the python-based tool Sublist3r to enumerate and include all subdomains of each domain in our study.",
    "meth_step3": "Assessing each subdomain using Pshtt",
    "meth_step3_content": "For each subdomain, Pshtt is used to assess adherence to HTTPs best practices. Through the tool, many dimensions are tested including HTTPs support, HTTPs enforcement, HSTS adoption..etc.\n\nPshtt (\"pushed\") is an open source tool to scan domains for HTTPS best practices. It saves its results to a CSV (or JSON) file. It was developed to push organizations — especially large ones like the US Federal Government us — to adopt HTTPS across the enterprise.\n",
    "meth_step4": "Keeping only alive subdomains\n",
    "meth_step4_content": "Since many domains and subdomains in the official list we received are down, only alive ones were considered in the assessment.",
    "meth_step5": "Categorizing subdomains to Supports HTTPs, Enforces HTTPs, Uses HSTS and grading them",
    "meth_step5_content": "Following the scoring scheme of Pshtt, domains and subdomains are categorized based on the following criteria:\n",
    "meth_step5_bullet1": "Domain Supports HTTPS - A domain 'Supports HTTPS' when it doesn't downgrade and has valid HTTPS, or when it doesn't downgrade and has a bad chain but not a bad hostname (a bad hostname makes it clear the domain isn't actively attempting to support HTTPS, whereas an incomplete chain is just a mistake.). Domains with a bad chain \"support\" HTTPS but user-side errors can be expected.\n",
    "meth_step5_bullet2": "Domain Enforces HTTPS - A domain that 'Enforces HTTPS' must 'Support HTTPS' and default to HTTPS. For websites (where Redirect is false) they are allowed to eventually redirect to an https:// URI. For \"redirect domains\" (domains where the Redirect value is true) they must immediately redirect clients to an https:// URI (even if that URI is on another domain) in order to be said to enforce HTTPS.\n",
    "meth_step5_bullet3": "Domain Uses Strong HSTS - A domain 'Uses Strong HSTS' when the max-age ≥ 31536000.\n",
    "meth_score_subtitle": "Accordingly, the following table defines the criteria to score subdomain by giving them a letter from A till F.\n",
    "Score": "Score",
    "Description": "Description",
    "A_desc": "Domain uses strong HSTS and Domain enforces HTTPS",
    "B_desc": "Domain enforces HTTPS but doesn’t use strong HSTS",
    "C_desc": "Domain supports HTTPS and doesn’t downgrade HTTPS",
    "D_desc": "Domain HTTPs endpoints are live but downgrade to HTTP",
    "F_desc": "No HTTPs endpoints are live.",
    "searchHelperText": "Search for a government entity. e.g. Ministry of Justice"
  },
  "ar": {
    "toChangeLanguage": "English",
    "qusai": "arabic",
    "out_of": " من ",
    "abthttps": "عن الHTTPS",
    "imphttps": "اهمية الHTTPS",
    "methodology": "المنهجية",
    "Domain": "النطاق",
    "Domain(Agency)_short": "النطاق(الجهة)",
    "Domain_short": "النطاق",
    "Agency": "الجهة",
    "Agency_short": "الجهة",
    "Domain Supports HTTPS": "التشفير من خلال الHTTPS",
    "Domain Supports HTTPS_short": "HTTPS",
    "Domain Enforces HTTPS": "يفرض استخدام الHTTPS",
    "Domain Enforces HTTPS_short": "يفرض الHTTPS",
    "HSTS": "يستخدم الHSTS",
    "HSTS_short": "HSTS",
    "grade": "الرتبة",
    "grade_short": "الرتبة",
    "mainTitle": "هل مواقع الحكومة الأردنية آمنة؟",
    "subTitle": "يتيح بروتوكول الHTTPS الأمان والخصوصية للمستخدمين ويمنع الرقابة. أرادت الجمعية الأردنية للمصدر المفتوح البحث في أمان المواقع الحكومية ، ونشأ السؤال التالي: ما هي النسبة المئوية للمواقع ضمن نطاق .gov.jo التي تستخدم بروتوكول HTTPS؟",
    "josa": "الموقع الرئيسي للجمعية الأردنية للمصدر المفتوح",
    "home": "الرئيسية",
    "intro": "مقدمة",
    "intro_content": "يؤدي تسليم صفحات الويب والبيانات عبر اتصالات HTTP إلى تعريض المستخدمين لمخاطر أمنية،\nنظرًا لأن الخوادم عادةً لا تكون متصلة ببعضها البعض بشكل مباشر ، فيجب عليها تمرير طلباتها واستجاباتها عبر سلسلة من أجهزة توجيه الشبكة. تتمتع أجهزة التوجيه هذه ، الموجودة بين الخوادم بوصول كامل إلى الطلبات المرسلة عبر اتصالات HTTP لأنه يتم نقل البيانات كنص عادي غير مشفر ، يمكن لأجهزة التوجيه أن تعمل \"كرجل في المنتصف\" وقراءة البيانات أو معالجتها أثناء النقل.\nيمكن أن يتسبب ذلك في تلقي المستخدمين لمعلومات تم التلاعب بها أو توجيههم إلى خوادم معادية يستخدمها المهاجمون لسرقة معلومات مثل كلمات المرور ومعلومات بطاقة الائتمان لا  يمكن أن يتم اكتشاف هذا النوع من الاعتراض نظرًا لأن استجابة HTTP المخترقة تبدو مماثلة للاستجابة الحقيقية.\n",
    "what": "ما هو الHTTPS؟",
    "what_content": "بروتوكول نقل النص التشعبي الآمن ، هو الإصدار الآمن من HTTP ، وهو البروتوكول الأساسي المستخدم لإرسال البيانات بين متصفح الويب وموقع الويب، يتم تشفير HTTPS من أجل زيادة أمان نقل البيانات ،هذا مهم بشكل خاص عندما ينقل المستخدمون بيانات حساسة ، مثل تسجيل الدخول إلى حساب مصرفي أو خدمة البريد الإلكتروني أو مزود التأمين الصحي.\n\nأي موقع ويب ، خاصة تلك التي تتطلب بيانات اعتماد تسجيل الدخول ،يجب أن يستخدم HTTPS. في متصفحات الويب الحديثة مثل Chrome و Firefox، يتم تمييز مواقع الويب التي لا تستخدم HTTPS بشكل مختلف عن تلك الموجودة. ابحث عن قفل أخضر في شريط URL للإشارة إلى أن صفحة الويب آمنة ،متصفحات الويب تأخذ HTTPS على محمل الجد .\n",
    "how": "كيف يعمل HTTPS؟",
    "how_content": "يستخدم HTTPS بروتوكول التشفير لتشفير الاتصالات. يُطلق على البروتوكول اسم \nTransport    Layer Security ) (TLS) ، على الرغم من أنه كان يُعرف سابقًا باسم Secure Sockets Layer (SSL). يؤمن هذا البروتوكول الاتصالات باستخدام ما يُعرف بالبنية التحتية للمفتاح العام غير المتماثل، يستخدم هذا النوع من أنظمة الأمان مفتاحين مختلفين لتشفير الاتصالات بين الطرفين:\n\nالمفتاح الخاص - يتم التحكم في هذا المفتاح بواسطة مالك موقع الويب ويتم الاحتفاظ به ، يكون للقارئ على أنه خاص يتواجد هذا المفتاح على خادم ويب ويستخدم لفك تشفير المعلومات المشفرة بواسطة المفتاح العام.\nالمفتاح العام - هذا المفتاح متاح لكل من يريد التواصل مع الخادم بطريقة آمنة. لا يمكن فك تشفير المعلومات التي يتم تشفيرها بواسطة المفتاح العام إلا من خلال المفتاح الخاص.",
    "whatHSTS": "ما هو HSTS؟",
    "whatHSTS_content": "هو معيار ل http  وهي طريقة تستخدمها مواقع الويب للإعلان عن وجوب الوصول إليها فقط باستخدام اتصال آمن (HTTPS). إذا أعلن أحد مواقع الويب عن سياسة HSTS ، فيجب على المتصفح رفض جميع اتصالات HTTP ومنع المستخدمين من قبول شهادات SSL غير الآمنة. يتم دعم HSTS حاليًا من قبل معظم المتصفحات الرئيسية (فقط بعض متصفحات الهاتف المحمول تفشل في استخدامه)\n\nيؤدي هذا إلى تفعيل سياسة الأمان الصارم للنقل إنه يفرض هذه الاتصالات عبر تشفير HTTPS ، متجاهلاً استدعاء أي نص برمجي لتحميل أي مورد في هذا المجال عبر HTTP. HSTS ليس سوى سهم واحد في حزمة مجمعة من إعدادات الأمان لخادم الويب أو خدمة استضافة الويب الخاصة بك.\n",
    "imp": "ما أهمية HTTPS؟ ماذا يحدث إذا كان موقع الويب لا يحتوي على HTTPS؟",
    "imp_content": "يمنع HTTPS مواقع الويب من بث معلوماتها بطريقة يسهل على أي شخص يتطفل على الشبكة الاطلاع عليها، فمثلا عندما يتم إرسال المعلومات عبر بروتوكول HTTP العادي ، يتم تقسيم المعلومات إلى حزم من البيانات التي يمكن \"تتبعها\" بسهولة باستخدام برامج مجانية. هذا يجعل الاتصال عبر وسيط غير آمن ، مثل شبكة Wi-Fi العامة أكثر عرضة للاعتراض. في الواقع ، تحدث جميع الاتصالات عبر HTTP بنص عادي غير مشفر، مما يجعلها في متناول أي شخص لديه الأدوات الصحيحة ، وعرضة لهجمات المسار.",
    "benefits": "فوائد الHTTPS",
    "ben1_title": "أمان أفضل للموقع الإلكترونية:",
    "ben1_content": "يضمن بروتوكول الHTTPS أن يتم تشفير جميع الاتصال بين مواقع الكترونية وخوادم الويب. لذلك، يتم إرسال جميع الاتصالات المرسلة والمستلمة إرسالها واستلامها من خادم ويب موثق.",
    "ben2_title": "يحمي خصوصية المستخدم:",
    "ben2_content": "بدون استخدام الHTTPS ، يمكن التجسس على الاتصالات أثناء نقل المعلومات بين الموقع والخادم. ",
    "ben3_title": "تجنب تعديل المحتوى غير المرغوب فيه:",
    "ben3_content": "إذا تمكن المتصنت من قراءة البيانات غير المشفرة أثناء النقل ، فيمكنه أيضًا تعديل هذا المحتوى.",
    "ben4_title": "تصنيفات البحث الأعلى:",
    "ben4_content": "ترتبط شهادات TLS / SSL بالترتيب الأعلى في محركات البحث ، وهو أمر ضروري لزيادة الثقة في المواقع الحكومية.",
    "ben5_title": "تجنب تحذيرات المتصفح:",
    "ben5_content": "معظم المتصفحات الحديثة ستظهر للمستخدمين تحذيرًا عند الدخول إلى موقع غير محمي ببروتوكول HTTPS. يؤدي هذا إلى عدم تشجيع المستخدمين من دخول الموقع ، حيث إنهم يلتزمون غالبًا برسالة التحذير.",
     "meth_subtitle": "لإنجاز هذا البحث، تم تنفيذ الخطوات التالية:",
    "meth_step1": "الحصول على قائمة بالمواقع الحكومية",
    "meth_step1_content": "تمكنا من الحصول على قائمة بالمواقع الحكومية والحهات المسؤولة عنها بعد تقديم طلب لوزارة الاقتصاد الرقمي والريادة.",
    "meth_step2": "إيجاد كل النطاقات الفرعية لكل نطاق بالقائمة",
    "meth_step2_content": "لا بد من أخذ النطاقات الفرعية لكل نطاق رئيسي بعين الاعتبار، كونها تمثل بوابات مختلفة قد تلتزم أو لا تلتزم بالممراسات الفضلى المتعلقة بالHTTPS.",
    "meth_step3": "تقييم كل نطاق رئيسي وفرعي باستخدام Pshtt",
    "meth_step3_content": "استخدام Pshtt لتقيم مدى التزام كل نطاف فرعي بالممراسات الفضلى للHTTPS. تساعدنا هذه الأداة على دراسة أبعاد مختلفة عن الHTTPS كدعمه وفرضه وغيره من الجوانب. والجدير بالذكر أن Pshtt طورت لتشجيع المؤسسات الكبيرة (كالمؤسسات الفدرالية الأمريكية) على تبني أفضل ممارسات الHTTPS.",
    "meth_step4": "إبقاء النطاقات الفاعلة(الحية) فقط",
    "meth_step4_content": "كان من الضروري إبقاء النطاقات الفاعلة(الحية) فقط، لأن كثيراً من النطاقات في القائمة الأصلية لا تعمل(غير حية).",
    "meth_step5": "تصنيف النطاقات إلى: يدعم HTTPS، يفرض HTTPS، يستخدم HSTS وإعطائهم علامات",
    "meth_step5_content": "اتباعاً لأسس التقييم في Pshtt، يصنف كل نطاف حسب المعايير التالية:",
    "meth_step5_bullet1": "النطاق يدعم HTTPS - يعتبر النطاق \"يدعم HTTPS\" عندما لا يخفض طلبات HTTPS ويملك نقطة نهاية اتصال HTTPS صالحة، ",
    "meth_step5_bullet2": "يعتبر النطاق \"يفرض HTTPS\" عندما \"يدعم HTTPS\" ويحول طلبات الHTTP إلى HTTPS.",
    "meth_step5_bullet3": "يعتبر النطاق \"يستخدم HSTS\" عندما يخقق شروط إعلان سياسة الHSTS.",
    "meth_score_subtitle": "وبناءً عليه، يعرف الجدول التالي معايير تقييم كل نطاق على سلم من A إلى F.",
    "score": "العلامة",
    "description": "الوصف",
    "A_desc": "النطاف يستخدم HSTS ويفرض الHTTPS",
    "B_desc": "النطاق يفرض HTTPS ولكن لا يستخدم HSTS",
    "C_desc": "النطاق يدعم الHTTPS ولا يحوله لHTTP",
    "D_desc": "النطاق يشعل بوابات HTTPS ولكنه يحول الطلبات لHTTP",
    "F_desc": "لا يشغل أو يدعم HTTPS ابداً",
    "searchHelperText": "ابحث عن جهة حكومية، مثلا وزارة العدل"
  }
}
